<template>
  <div class="grid-wrap mt-3">
    <ag-grid-vue
      style="height: 398px"
      class="ag-theme-alpine"
      :defaultColDef="defaultColDef"
      :columnDefs="columnDefs"
      :rowData="rowData"
      :pagination="false"
      :isFullWidthRow="isFullWidthRow"
      :headerHeight="34"
      :rowHeight="36"
      :rowSelection="rowSelection"/>
    <pagination />  
  </div>
</template>

<script>
import Pagination from '@/components/Pagination'
import { AgGridVue } from 'ag-grid-vue'

export default {
  components: {
    AgGridVue,
    Pagination
  },
  data() {
    return {
      columnDefs: null,
      rowData: null,
      rowSelection: null,
      defaultColDef: {
        flex: 1,
        // resizable: true,
        // sortable: true,
        // filter: true,
      },
    }
  },
  methods() {
    
  },
  beforeMount() {
    this.columnDefs = [
      // { field: 'make' },
      // { field: 'model' },
      // { field: 'price' }
      { field: 'No', width: 60, maxWidth: 60, },
      { field: '+', width: 40, maxWidth: 40},
      { field: '충전기ID' },
      { field: '충전기명' },
      { field: '충전소ID' },
      { field: '충전소명' },
      { field: '충전기 상태' },
      { field: '충전기제조사' },
      { field: '충전기모델명' },
      { field: '상태변경일시' },
      { field: '최종상태' },
      { field: '최근회원인증' },
      { field: '회원인증상태' },
      { field: '최근오류', },
      { field: '최근민원', },
    ],
    this.rowData = [
      // { make: 'Ford', model: 'Mondeo', price: 32000 },
      // { make: 'Porsche', model: 'Boxter', price: 72000 },
      { No: 1, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 2, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 3, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 4, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 5, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 6, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 7, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 8, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 9, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
      { No: 10, more: '+', 충전기ID: 'SIG00000302', 충전기명: 'SIG00000302', 충전소ID: 'SIG00000302', 충전소명: '마포유수지 공영주차장', 충전기상태: '양호 - 양호', 충전기제조사: 'SK시그넷', 충전기모델명: '시그넷EV(14kw)', 상태변경일시: '2022-09-22 14:59:47',  최종상태: '연결',  회원인증상태: '성공, 실패', 최근오류: '2022-09-22 09:36:34 ', 최근민원: '2022-09-22 09:36:34'},
    ],
    this.rowSelection = 'single';
  }
}
</script>

<style scoped>

</style>
